// 1,新增{
//     1，生成列表结构（v-for数组数据进行绑定的）
//     2,获取用户输入（v-model绑定）
//     3，回车，新增数据（v-on,enter添加数据 事件修饰符）
//     4,通过审查元素快速定位
// }
// 2，删除{
//     1，点击删除指定内容（v-on splice）
//     ：
//     1，数据改变，和数据绑定的元素同步改变的
//     2，事件的自定义参数
//     3，splice是根据索引进行删除的
// }
// 3，统计{
//     1，统计信息个数（v-text length）
//     :
//     1,基于数据的开发方式
//     2，v-text的作用是文本

// }
// 4，清空{
//     :
//     1,基本数据的开发方式
// }
// 5，隐藏{
//     1，没有数据时，隐藏元素(v-show v-if 数据非空)
//     :
//     1,列表结构可以通过v-for指令结合数据生成
//     2，v-on结合事件修饰符可以对事件进行限制，比如.enter添加数据
//     v-on再绑定事件时可以传递自定义参数
//     通过v-model可以快速的设置和获取表单元素的值
//     基于数据的开发方式
// }